# ██╗  ██╗ ██████╗ ███╗   ███╗███████╗██████╗ ██████╗ ███████╗██╗    ██╗
# ██║  ██║██╔═══██╗████╗ ████║██╔════╝██╔══██╗██╔══██╗██╔════╝██║    ██║
# ███████║██║   ██║██╔████╔██║█████╗  ██████╔╝██████╔╝█████╗  ██║ █╗ ██║
# ██╔══██║██║   ██║██║╚██╔╝██║██╔══╝  ██╔══██╗██╔══██╗██╔══╝  ██║███╗██║
# ██║  ██║╚██████╔╝██║ ╚═╝ ██║███████╗██████╔╝██║  ██║███████╗╚███╔███╔╝
# ╚═╝  ╚═╝ ╚═════╝ ╚═╝     ╚═╝╚══════╝╚═════╝ ╚═╝  ╚═╝╚══════╝ ╚══╝╚══╝
# The Missing Package Manager for macOS (or Linux).
#

{{- /* Brewfile is macOS-only. On Linux/WSL all packages route through
       pacman/paru (Arch) or apt/dnf (Debian/Fedora) via package_mapping.
       Homebrew was dropped from the Linux flow because a user-prefix install
       at ~/.local/share/homebrew can't use upstream bottles (those are
       compiled for /home/linuxbrew/.linuxbrew) and source-building every
       formula takes hours. See run_onchange_before_install_base_packages_unix.sh.tmpl. */ -}}
{{- if eq .chezmoi.os "darwin" -}}
{{- $b := .brew_bundle }}

{{- /* ====================== TAPS ====================== */ -}}
{{- if eq .chezmoi.os "darwin" }}
{{- range $b.taps_darwin }}
{{- if hasKey . "url" }}
tap "{{ .name }}", "{{ .url }}"
{{- else }}
tap "{{ .name }}"
{{- end }}
{{- end }}
{{- end }}

{{- /* ============ ALWAYS-ON FORMULAE (all hosts) ============ */ -}}

{{- /* Cross-platform jq/less/yq/etc. */ -}}
{{- range .always_install.brew }}
brew "{{ . }}"
{{- end }}

{{- if eq .chezmoi.os "darwin" }}
{{- range $b.formulae_darwin }}
brew "{{ . }}"
{{- end }}
{{- end }}

{{- /* ============ LOCAL-ONLY FORMULAE (skipped on remote) ============ */ -}}
{{- if not .is_remote }}

# Build deps for mise runtimes
{{- range $b.formulae_build_deps }}
brew "{{ . }}"
{{- end }}
{{- if eq .chezmoi.os "linux" }}
{{- range $b.formulae_build_deps_linux }}
brew "{{ . }}"
{{- end }}
{{- end }}
{{- range $b.formulae_build_deps_head }}
brew "{{ . }}", args: ["HEAD"]
{{- end }}

{{- if .package_features.php }}
# PHP build deps
{{- range $b.formulae_php }}
brew "{{ . }}"
{{- end }}
{{- end }}

# Build toolchain
{{- range $b.formulae_toolchain }}
brew "{{ . }}"
{{- end }}
{{- if eq .chezmoi.os "darwin" }}
{{- range $b.formulae_toolchain_darwin }}
brew "{{ . }}"
{{- end }}
{{- end }}
{{- if eq .chezmoi.os "linux" }}
{{- range $b.formulae_toolchain_linux }}
brew "{{ . }}"
{{- end }}
{{- end }}

# Standalone workstation tools
{{- range $b.formulae_standalone }}
brew "{{ . }}"
{{- end }}
{{- end }}{{/* end !is_remote */}}

{{- /* ========= GNU REPLACEMENTS FOR BSD TOOLS (darwin only) ========= */ -}}
{{- if eq .chezmoi.os "darwin" }}
{{- range $b.formulae_gnu_darwin }}
brew "{{ . }}"
{{- end }}
{{- end }}

{{- /* ============ FEATURE-GATED PACKAGES (from package_mapping) ============ */ -}}
{{- if .install_packages }}
{{- range $feature, $enabled := .package_features }}
{{- if $enabled }}
{{- if hasKey $.package_mapping $feature }}
{{- $mapping := index $.package_mapping $feature }}
{{- if hasKey $mapping $.chezmoi.os }}
{{- $platform := index $mapping $.chezmoi.os }}
{{- if and (hasKey $platform "brew") $platform.brew }}
{{- range $platform.brew }}
brew "{{ . }}"
{{- end }}
{{- end }}
{{- if and (hasKey $platform "cask") $platform.cask }}
{{- range $platform.cask }}
cask "{{ . }}"
{{- end }}
{{- end }}
{{- end }}
{{- end }}
{{- end }}
{{- end }}
{{- end }}

{{- /* ==================== DARWIN EXTRAS ==================== */ -}}
{{- if eq .chezmoi.os "darwin" }}

# Tap-specific formulae (HEAD)
{{- range $b.formulae_tap_head_darwin }}
brew "{{ . }}", args: ["HEAD"]
{{- end }}

# Fonts
{{- range $b.casks_darwin_fonts }}
cask "{{ . }}"
{{- end }}

# Desktop apps
{{- range $b.casks_darwin_apps }}
cask "{{ . }}"
{{- end }}

# Mac App Store
{{- range $b.mas_darwin }}
mas "{{ .name }}", id: {{ .id }}
{{- end }}
{{- end }}
{{- end }}
